>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MEU_PROGRAMA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 VARIAVEL-EXEMPLO PIC X(20) VALUE "Hello, COBOL".
PROCEDURE DIVISION.
    DISPLAY VARIAVEL-EXEMPLO.
    STOP RUN.
